import os
import sys
import platform
import socket
import time

# def print_dots():
#     sys.stdout.flush()
#     time.sleep(1)  # Задержка перед выведением первой точки
#     for _ in range(3):
#         sys.stdout.write('.')
#         sys.stdout.flush()
#         time.sleep(1)  # Задержка между точками
#     print()  # Переход на новую строку

# print("Загрузка", end='')
# print_dots()

# def progress_bar(duration):
#     for i in range(101):
#         time.sleep(duration / 100)
#         sys.stdout.write(f'\rПрогресс: [{i * "■":<100}] {i}%')
#         sys.stdout.flush()

# progress_bar(5)  # Прогресс-бар на 5 секунд
# print("\nГотово!")

# # from rich.progress import track

# # def task():
# #     time.sleep(0.1)  # Имитация работы

# # for _ in track(range(100), description="Загрузка..."):
# #     task()
# # print("Готово!")

# print(f'OS NAME: {os.name}')
# print(f'Операционная система: {platform.system()}')
# print(f'Версия Python: {sys.version}')
# print(f'Архитектура процессора: {platform.machine()}')
# print(f'Имя процессора: {platform.processor()}')
# print(f'Имя компьютера: {socket.gethostname()}')
# time.sleep(10)

# print(f'\n\033[1;36m{'Форматированный вывод текста'.center(52)}\033[0m\n')

# print(f' \033[1m{'Стиль текста':<43} {'Код':^3} {'Пример':^6}\033[0m')
# print(f' {'───────────────────────────────────────────'} {'───'} {'──────'}')
# print(f' {'Сброс к начальным значениям':<43} {'0':^3} \033[0m{'Text':^6}\033[0m')
# print(f' {'Жирный':<43} {'1':^3} \033[1m{'Text':^6}\033[0m')
# print(f' {'Блекый':<43} {'2':^3} \033[2m{'Text':^6}\033[0m')
# print(f' {'Курсив':<43} {'3':^3} \033[3m{'Text':^6}\033[0m')
# print(f' {'Подчёркнутый':<43} {'4':^3} \033[4m{'Text':^6}\033[0m')
# print(f' {'Редкое мигание':<43} {'5':^3} \033[5m{'Text':^6}\033[0m')
# print(f' {'Частое мгание':<43} {'6':^3} \033[6m{'Text':^6}\033[0m')
# print(f' {'Смена цвета фона с цветом текста (инверсия)':<43} {'7':^3} \033[7m{'Text':^6}\033[0m\n\n')

# print(f' \033[1m{'Цвет':<28} {'Текст':^5} {'Пример':^6} {'Фон':^5} {'Пример':^6}\033[0m')
# print(f' {'────────────────────────────'} {'─────'} {'──────'} {'─────'} {'──────'}')
# print(f' {'Чёрный':<28} {'30':^5} \033[30m{'Text':^6}\033[0m {'40':^5} \033[40m{'Text':^6}\033[0m')
# print(f' {'Красный':<28} {'31':^5} \033[31m{'Text':^6}\033[0m {'41':^5} \033[41m{'Text':^6}\033[0m')
# print(f' {'Зелёный':<28} {'32':^5} \033[32m{'Text':^6}\033[0m {'42':^5} \033[42m{'Text':^6}\033[0m')
# print(f' {'Жёлтый':<28} {'33':^5} \033[33m{'Text':^6}\033[0m {'43':^5} \033[43m{'Text':^6}\033[0m')
# print(f' {'Синий':<28} {'34':^5} \033[34m{'Text':^6}\033[0m {'44':^5} \033[44m{'Text':^6}\033[0m')
# print(f' {'Фиолетовый':<28} {'35':^5} \033[35m{'Text':^6}\033[0m {'45':^5} \033[45m{'Text':^6}\033[0m')
# print(f' {'Бирюзовый':<28} {'36':^5} \033[36m{'Text':^6}\033[0m {'46':^5} \033[46m{'Text':^6}\033[0m')
# print(f' {'Белый':<28} {'37':^5} \033[37m{'Text':^6}\033[0m {'47':^5} \033[47m{'Text':^6}\033[0m\n')

# print(f'\n\033[1;36m{'Синтаксис'.center(52)}\033[0m\n')
# print('\033[2m 1 | \033[0m \033[37mstr \033[36m= "\033[32mHello\033[36m"\033[0m')
# print('\033[2m 2 | \033[0m \033[34mprint\033[33m(\033[35mf\033[36m"\033[0m\\033\033[32m[\033[31mcode\033[32mm\033[35m{\033[37mstr\033[35m}\033[37m\\033\033[32m[0m\033[36m"\033[33m)\033[0m\033[2m # Где "code" заменяется на код из таблиц, а "\\033[0m" конец форматирования\033[0m')
# print('\033[2m 3 | \033[0m \033[34mprint\033[33m(\033[35mf\033[36m"\033[0m\\033\033[32m[\033[31mcode_1\033[37m;\033[31mcode_2\033[37m;\033[31mcode_3\033[32mm\033[35m{\033[37mstr\033[35m}\033[37m\\033\033[32m[0m\033[36m"\033[33m)\033[0m\033[2m # Если надо применить к строке несколько стилей и/или цветов\033[0m')

